const ourPlayList = [
    {
        id: 1,
        name: 'رپ',
        type:'ourPlayList',
        data: [{
            id: '89643',
            photo: 'https://assets.rjassets.com/static/mp3/pishro-rap-game-(ft-owj)/16665e5cc83dfd0.jpg',
            link: "https://host2.mediacon-rj.app/media/mp3/mp3-256/89643-3ec826c9c179bbd.mp3",
            plays: '2,474,839',
            likes: '3,699',
            downloads: '2,474,839',
            song_farsi: "رپ گیم اوج",
            artist_farsi: "پیشرو",
        },

        {
            id: '76394',
            photo: "https://assets.rjassets.com/static/mp3/pishro-rapere-ghadimi-(erfam-remix)/466e92daec4720e.jpg",
            link: "https://host2.mediacon-rj.app/media/mp3/mp3-256/76394-f043aabcd0e56c1.mp3",
            plays: '2,312,733',
            likes: '3,533',
            downloads: '2,312,733',
            song_farsi: "رپر قدیمی ریمیکس",
            artist_farsi: "پیشرو",
        },
        {
            id: '22419',
            photo: "https://assets.rjassets.com/static/mp3/ali-sorena-majnoone-shahr/9a452da8de927f4.jpg",
            link: "https://host1.mediacon-rj.app/media/mp3/mp3-256/22419-760a12d8d2f0bfc.mp3",
            plays: '4,523,691"',
            likes: '9,827',
            downloads: '4,523,691',
            song_farsi: "علی سورنا",
            artist_farsi: "مجنون شهر",
        },

        {
            id: '22417',
            photo: "https://assets.rjassets.com/static/mp3/ali-sorena-nemitarsam/68eba671e2b61c2.jpg",
            link: "https://host1.mediacon-rj.app/media/mp3/mp3-256/22417-2080d359c26ce7d.mp3",
            plays: '3,563,743"',
            likes: '6,179',
            downloads: '3,563,743',
            song_farsi: "نمیترسم",
            artist_farsi: "علی سورنا",
        }]

    },

    {
        id: 2,
        name: 'سنتی',
        type:'ourPlayList',
        data: [{
            id: '97284',
            photo: "https://assets.rjassets.com/static/mp3/homayoun-shajarian-asemane-abri/d3d91b20e3e12ca.jpg",
            link: "https://host2.mediacon-rj.app/media/mp3/mp3-256/97284-282b44b8917942d.mp3",
            plays: '15,894,699',
            likes: '18,189',
            downloads: '15,894,699',
            song_farsi: "آسمان ابری",
            artist_farsi: "همایون شجریان",
        },
        {
            id: '99193',
            photo: "https://assets.rjassets.com/static/mp3/homayoun-shajarian-yek-nafas-arezouye-to/831b1137962e9db.jpg",
            link: "https://host2.mediacon-rj.app/media/mp3/mp3-256/99193-226394f93acb3c4.mp3",
            plays: '10,246,788',
            likes: '13,204',
            downloads: '10,246,788',
            song_farsi: "یک نفس آرزوی تو",
            artist_farsi: "همایون شجریان",
        },

        {
            id: '98183',
            photo: "https://assets.rjassets.com/static/mp3/homayoun-shajarian-havaye-zemzemehayet/a4bf9281bfa5b7d.jpg",
            link: "https://host2.mediacon-rj.app/media/mp3/mp3-256/98183-b35aef05f4b0c2e.mp3",
            plays: '10,474,856',
            likes: '11,836',
            downloads: "10,474,856",
            song_farsi: "هوای زمزمه هایت",
            artist_farsi: "همایون شجریان",
        },
        {
            id: '20169',
            photo: "https://assets.rjassets.com/static/mp3/homayoun-shajarian-havaye-geryeh/2a9977cb7f7eda3.jpg",
            link: "https://host1.mediacon-rj.app/media/mp3/mp3-256/20169-f38d85c950deebe.mp3",
            plays: '17,345,802',
            likes: '24,913',
            downloads: '17,345,802',
            song_farsi: "هوای گریه",
            artist_farsi: "همایون شجریان",
        }]
    },

    {
        id: 3,
        name: 'پاپ v1',
        type:'ourPlayList',
        data: [{
            id: '101612',
            photo: "https://assets.rjassets.com/static/mp3/shadmehr-aghili-daste-man-nist/52fbbf01742ce4f.jpg",
            link: "https://host2.mediacon-rj.app/media/mp3/mp3-256/101612-f7b4c735bc5e301.mp3",
            plays: '86,274,517',
            likes: '80,829',
            downloads: '86,274,517',
            song_farsi: "دست من نیست",
            artist_farsi: "شادمهر عقیلی",
        },
        {
            id: '105744',
            photo: "https://assets.rjassets.com/static/mp3/shadmehr-aghili-chera-too-jangi/95796ce775c9a91.jpg",
            link: "https://host2.mediacon-rj.app/media/mp3/mp3-256/105744-949f30374731f94.mp3",
            plays: '49,421,095',
            likes: '49,850',
            downloads: '49,421,095',
            song_farsi: "چرا تو جنگی",
            artist_farsi: "شادمهر عقیلی",
        },
        {
            id: '113832',
            photo: "https://assets.rjassets.com/static/mp3/ali-yasini-nesfe-shab/2313b1b542f2d82.jpg",
            link: "https://host2.mediacon-rj.app/media/mp3/mp3-256/113832-64271a002902289.mp3",
            plays: '19,168,731',
            likes: '30,986',
            downloads: '19,168,731',
            song_farsi: "نصف شب",
            artist_farsi: "علی یاسینی",
        },
        {
            id: '113403',
            photo: "https://assets.rjassets.com/static/mp3/ali-yasini-nade-ghol/ad762502b6565d4.jpg",
            link: "https://host2.mediacon-rj.app/media/mp3/mp3-256/113403-26c03bf2a132d0a.mp3",
            plays: '21,169,634',
            likes: '29,491',
            downloads: '21,169,634',
            song_farsi: "نده قول",
            artist_farsi: "علی یاسینی",
        }]
    },

    {
        id: 4,
        name: 'پاپ v2',
        type:'ourPlayList',
        data: [
            {
                id: '113403',
                photo: "https://assets.rjassets.com/static/mp3/ali-yasini-nade-ghol/ad762502b6565d4.jpg",
                link: "https://host2.mediacon-rj.app/media/mp3/mp3-256/113403-26c03bf2a132d0a.mp3",
                plays: '21,169,634',
                likes: '29,491',
                downloads: '21,169,634',
                song_farsi: "نده قول",
                artist_farsi: "علی یاسینی",
            },
            {
                id: '101612',
                photo: "https://assets.rjassets.com/static/mp3/shadmehr-aghili-daste-man-nist/52fbbf01742ce4f.jpg",
                link: "https://host2.mediacon-rj.app/media/mp3/mp3-256/101612-f7b4c735bc5e301.mp3",
                plays: '86,274,517',
                likes: '80,829',
                downloads: '86,274,517',
                song_farsi: "دست من نیست",
                artist_farsi: "شادمهر عقیلی",
            },
            {
                id: '105744',
                photo: "https://assets.rjassets.com/static/mp3/shadmehr-aghili-chera-too-jangi/95796ce775c9a91.jpg",
                link: "https://host2.mediacon-rj.app/media/mp3/mp3-256/105744-949f30374731f94.mp3",
                plays: '49,421,095',
                likes: '49,850',
                downloads: '49,421,095',
                song_farsi: "چرا تو جنگی",
                artist_farsi: "شادمهر عقیلی",
            },
            {
                id: '113832',
                photo: "https://assets.rjassets.com/static/mp3/ali-yasini-nesfe-shab/2313b1b542f2d82.jpg",
                link: "https://host2.mediacon-rj.app/media/mp3/mp3-256/113832-64271a002902289.mp3",
                plays: '19,168,731',
                likes: '30,986',
                downloads: '19,168,731',
                song_farsi: "نصف شب",
                artist_farsi: "علی یاسینی",
            },
        ]
    },
]

// const data =

// {
//     id: '',
//     photo: '',
//     link: '',
//     plays: '',
//     likes: '',
//     downloads: '',
//     song_farsi: '',
//     artist_farsi: '',
// }


const artists = [
    { name: 'محسن یگانه', photo: '../Images/yegane.jpg' ,text:`محسن یگانه متولد 23 اردیبهشت 1364 در گنبد کاووس، خواننده است . دانشجوی انصرافی لیسانس مهندسی صنایع دانشگاه آزاد در ترم شش است، دو خواهر پزشک و دندانپزشک و یک برادر بنام کمیل دارد، خودش فرزند یکی مانده به آخر خانواده است، مادرش استاد دانشگاه و پدرش محمدرضا یگانه کارمند جهاد، شهید دفاع مقدس است. زمانی که محسن 10 ماهه بود پدرش در 23 اسفندماه 64 در سن 35 سالگی به درجه رفیع شهادت رسید. محسن یگانه اولین ترانه خود را در کنار محسن چاوشی با نام نشکن دلمو با ترانه سرایی و آهنگسازی خودش و تنظیمی از محسن چاوشی اجرا کرد. آلبوم اول او با نام سال کبیسه به صورت زیر زمینی منتشر شد. بعد از این آلبوم محسن یگانه فعالیت خود را با انتشار تک آهنگ ادامه داد؛ ناگفته نماند که اغلب همین تک آهنگ های پخش شده، برای جلوگیری از پراکندگی دور هم جمع می شد و به اسم آلبوم بروی سایت ها قرار می گرفت.`},

    { name: ' علی سورنا', photo: '../Images/sorena-390x390.png' ,text:`
    علی سورنا یکی از معروف ترین خوانندگان سبک رپ در ایرانی می باشد که به آهنگ هایی با مفاهیم عمیق معروف می باشد. علی خدامی ملقب به سورنا در 27 فروردین سال 1369 در شهر تهران به دنیا آمد. او پس از گذراندن دوران دبیرستان راهی دانشگاه شد و در رشته برق صنعتی به تحصیل پرداخت.

در همان سنین بود که او فعالیت خود را در سبک رپ آغاز کرد. در سن 18 سالگی با چندین آرتیست دیگر به نام های بنیامین، فرزان وحشت و بازپرس فعالیت زیرزمینی خود را آغاز و پس از مدتی به شهرت رسید. اشعار او در ابتدا بیشتر در زمینه اعتراضی بودند و به شرایط و مشکلات جامعه می پرداخت. اما پس از چند سال علی استایل خاص خود را پیدا و سعی کرد در زمینه آن به فعالیت بپردازد.

همچنین او در سال های بعدی فعالیتش چندین آلبوم منتشر کرد که آخرین آلبوم او گوزن بود. آلبوم گوزن با محبوبیت فراوانی همراه شد و به یکی از بهترین آلبوم های رپ فارسی تبدیل شد.`},
 
{ name: ' محمدرضا شجریان', photo: '../Images/محمدرضا+شجریان.jpg' ,text:`حمدرضا شجریان اول مهر ماه ۱۳۱۹ در مشهد متولد شد. ۵ ساله بود که در خلوت کودکانه‌اش آواز می‌خواند، ۱۵بهمن ۱۳۲۶ به کلاس اول می‌رود و یک سال بعد به آموزش تلاوت قرآن‌کریم نزد پدر می‌پردازد. در ۹ سالگی تلاوت قرآن را آغاز می‌کند و یک سال بعد این کار را  در میتینگ‌ها و اجتماعات سیاسی آن سال‌ها ادامه می‌دهد.
 
در سال ۱۳۳۱ برای نخستین بار صدای محمدرضا شجریان از رادیو خراسان پخش می‌شود. سال ۱۳۳۲ محمدرضا شجریان عنوان شاگرد ممتاز را در بین دانش آموزان مشهدی از آن خود می‌کند و سپس در دبیرستان شاهرضا تحصیلات خود را پی می‌گیرد. همزمان در مسابقات فوتبال دبیرستان‌های مشهد هم حضور می‌یابد و در سال ۱۳۳۴ موفق می‌شود به تیم دانش آموزی استان راه یابد.`},
 
{ name: 'علی یاسینی', photo: '../Images/Ali-Yasini.jpg' ,text:`علی یاسینی متولد ۱۴ آذر ۱۳۷۵ در تهران، خواننده می باشد. فارغ التحصیل لیسانس رشته معماری می باشد که با گیتار موسیقی را شروع کرد و حالا بعنوان آهنگساز و ترانه سرا بسیار پر طرفدار شده است. یاسینی در یک خانواده ۴ نفره با یک خواهر، بزرگ شده است و فعالیت خود را از از سال ۱۳۸۷ وقتی ۱۲ ساله بود با یادگیری گیتار شروع کرد.`},
  
{ name: 'رضا پیشرو', photo: '../Images/pishro.jpg' ,text:`محمدرضا ناصری آزاد (زادهٔ ۱۲ بهمن ۱۳۶۶) که با نام هنری رضا پیشرو شناخته شده که بعضی ها او را شاه رپ فارس نیز میدانند؛ خواننده، ترانه‌سرا، آهنگساز و تهیه‌کننده موسیقی در رپ فارسی اهل ایران است. او فعالیت غیرحرفه‌ای خود را از سال ۱۳۸۱ و با لقب «رضا 3pac» آغاز کرد. محمد رضا ناصری آزاد در طی فعالیت هنری خود در موسیقی همکاری های مشترکی با خوانندگانی مثل هیچکس و مهدیار آقاجانی و امیر تتلو و حسین تهی و علی قاف و بهرام نورایی داشته است . همچنین پیشرو با خوانندگان دیگری مثل عرفان و علی اوج و امیر قدر و حصین و صادق و بیگرض و سوگند نیز همکاری مشترک و آلبوم های مشترک داشته است .

 `},
    { name: ' هایده', photo: '../Images/hayde.jfif' ,text:`معصومه دَده‌بالا (۲۱ فروردین ۱۳۲۱ – ۳۰ دی ۱۳۶۸) که با نام هایده شناخته می‌شود، خوانندهٔ ایرانی بود. او در طول بیست سال فعالیت و ساخت بیش از ۲۰۰ ترانه، به‌واسطهٔ صدای اپرایی و آلتویی که داشت، در میان مردم به شهرت رسید و از او به‌عنوان یکی از برجسته‌ترین و تاثیرگذارترین خوانندگان ایران یاد می‌شود.`},
    { name: 'امیر تتلو', photo: 'https://apacheproject.info/wp-content/uploads/2020/08/Amir-tataloo-1.jpg' ,text:` امیر حسین مقصودلو با لقب هنری امیر تتلو، خواننده و ترانه سرای سبک آر اند بی «R&B» است، او زندگی پرفراز و نشیبی را داشته و زندگی هنری او همیشه پر از حواشی و تعریف و انتقاد بوده، از دید موسیقی و هنر تتلو خواننده اي در رده خوب است، آهنگ هاي او ریتم و ملودی خوبی دارد، او تکست هاي زیبایی می‌نویسد، صدای او تقلید از صدای دیگر خواننده ها نیست و همه ی اینها موجب می‌شود تا تتلو در فهرست خواننده هاي خوب قرار بگیرد.`},
    { name: 'ابی', photo: 'https://www.topnaz.com/wp-content/uploads/2014/11/%D8%A7%D8%A8%D8%B1%D8%A7%D9%87%DB%8C%D9%85-%D8%AD%D8%A7%D9%85%D8%AF%DB%8C-5.jpg' ,text:` ابراهیم حامدی مشهور به ابی زاده 29 خرداد سال 1328 است و خواننده پاپ ایرانی است. صدای او از جنس باریتون است و در سبک های مختلف موسیقی صاحب اثر است. او تحت تاثیر خوانندگانی مانند فرهاد مهراد، جنسیس، جیم موریسون، یوتو، کلدپلی و پر گسله بوده است.

    بعضی ها او را با تام جونز که خواننده سرشناس بریتانیایی است مقایسه می کنند. ابی به اقای صدا هم معروف است و تقریبا می توان گفت که پرطرفدارترین خواننده ایران است. ابراهیم حامدی نخستین بار در کاخ جوانان جنوبی روی صحنه می رود. تجربه اولین اجرای رسمی ابی از زبان خودششنیدنی است.آنطور کهاودر مصاحبه ای نقل کردهاست در نخستین اجرایش از شدت استرس زیاد نصفی از بدنش بی حس شد وبه خواب رفت.`},
    { name: 'محسن چاووشی', photo: 'https://app.akharinkhabar.ir/images/2020/07/15/e510f670-ae66-412e-b771-3d213b2083ac.jpeg' ,text:`محسن چاوشی حسینی متولد 8 مرداد 1358 خرمشهر است. چاووشی خواننده، آهنگساز، ترانه سرا و تنظیم کننده سبک پاپ و راک میباشد. محسن چاوشی داری قد ۱۸۵ سانتیمتر است. محسن چاوشی اصالتی کرد تبار دارد ولی بخاطر شغل پدرش که کارمند شرکت نفت خرمشهر بود به آنجا مهاجرت کردند و محسن در خرمشهر متولد شد. او فرزند پنجم خانواده است و سه برادر و دو خواهر دارد. بعد از اشغال خرمشهر در زمان جنگ، محسن چاوشی در سن 4 سالگی به همراه خانواده اش به شهرهای کرمانشاه و مشهد مهاجرت کردند وی تا سن 14 سالگی در این شهر زندگی کرد و پس از آن به تهران آمد. از نوجوانی به موسیقی علاقه داشته و پس از دریافت دیپلم حسابداری و اتمام دوره سربازی، فعالیت حرفه‌ای خود را در زمینه موسیقی در سال ۱۳۸۲ با آلبوم نفرین آغاز کرد و پس از اخذ مجوز در سال ۱۳۸۷ آلبوم یه شاخه نیلوفر را منتشر کرد. از وی تا کنون بیش از ۱۵۰ قطعه موسیقی شنیده شده‌است، که شامل ۱۱ آلبوم و نیز چندین تک آهنگ است. وی خواننده و آهنگساز ترانه‌های فیلم سینمایی سنتوری ساخته داریوش مهرجویی و نیز ترانه‌های سریال شبکه خانگی شهرزاد ساختهٔ حسن فتحی می‌باشد.`},
    { name: 'حصین', photo: 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRK-b1nSwslxbniFmLnupkeWmwbCgzzSQATDg&usqp=CAU' ,text:` حسین رحمتی متولد سال 66 در شهر مشهد است که با نام هنری حصین و یا حسین ابلیس شناخته می شود. او بعد از مدتی فعالیت تک نفره کار خود را با گروه 051 آغاز کرد و به عنوان یکی از رپران زیرزمینی فعالیت خود را ادامه داده است. حصین علاوه بر رپ خواندن، آهنگساز نیز می باشد. او فعالیت خود را از سال 1378 آغاز کرده است و تا به امروز فعالیت گسترده‌ ای در عرصه موسیقی انجام داده است. برای کسب اطلاعات بیشتر نیز می توانید حصین ویکی پدیا را مشاهده کنید. این رپر معروف فارغ التحصیل فوق لیسانس رشته ارتباطات از یکی از دانشگاه های سرشناس ارمنستان می باشد. حصین در یکی از مصاحبه های خود بیان کرده بود که از نوجوانی علاقه زیادی به موسیقی و خوانندگی داشته است به همین دلیل از سن 17 سالگی وارد این عرصه شده است. این رپر از سال 83 کارش را با گروه 051 و موزیک تو زنده میمونی آغاز کرد. اعضای گروه 051 شامل:کنبین، رضا، حسین ابلیس، مستر کیلر و مبهم بوده اند که بعد ها افراد دیگری مانند حسین تهی نیز به این گروه پیوستند. به دلیل این که اکثر اعضای این گروه اهل مشهد بودند نام این گروه 051 که ابتدای کد شهر مشهد است، انتخاب شد.`},
    { name: 'داریوش ', photo: 'https://photokade.com/wp-content/uploads/DariushEghbali-photokade-2.jpg' ,text:` داریوش اقبالی متولد  بهمن سال 1329 در شهر تهران است. داریوش خواننده، بازیگر و فعال اجتماعی ایرانی است، که در زمینه موسیقی راک و پاپ ایرانی فعال است.

    جنس صدای داریوش باس است. او عضو سازمان عفو بین الملل می باشد.  دوران کودکی در کرج و میانه بود. پدرش محمد یکی از ملاکان شهرستان میانه بود. نخستین بار در سن 9 سالگی، در جشنی در مدرسه در شهرآرا به روی صحنه رفت. او در دوران دبیرستان هم اجرا داشت.

    داریوش در سال 1349 با حسن خیاط باشی آشنا شد و همین اشنایی او باعث ورود رسمی او به دنیای خوانندگی و موسیقی حرفه ای شد. در همین سال و در سن 20 سالگی با ترانه به من نگو دوستت دارم با آهنگسازی درویش مصطفی جاویدان بسیار مشهور شد. نخستین ترانه مستقل او به نام نبسته پیمان با شعری از علی گزرسز و موسیقی خودش می باشد.`},
    { name: 'حمیرا', photo: 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQhVkxjs87hIUIONEpEYiRAu1ve11WyL5HJswOJtEF1PU1WunZI9sWSEvoXpcU9-LmaWE4&usqp=CAU' ,text:`پروانه امیرافشاری در ۱۳۲۳در تهران به دنیا آمد. وی از خانواده بانفوذ و سرشناس امیرافشاری که اصالتی آذری دارند می باشد. پدر ایشان مالک ۱۵۰ شهر و روستا در منطقه شرق ایران و توابع طالقان بودند. از همان کودکی حمیرا خانه آنها به افتخار افراد بانفوذ حکومتی شاهد مراسم بزرگ با حضور هنرمندان نامی آن زمان مثل قمرالملوک وزیری روح انگیز بنان ملوک ضرابی و … بود که همین انگیزه اولیه دختر خانواده برای رو آوری به آواز شد

    حمیرا به دور از چشم پدر و با تشویق همسر روشن فکر و تازه از آلمان بازگشته خودبا نام نویسی در تست صدا در شورای رادیو آن زمان حیرت و تحسین اعضا شورا را سبب شد و پس از آن تحت تعلیم استاد علی تجویدی و بانو ملوک ضرابی قرار گرفت.`},
    { name: '', photo: '' ,text:``},
    { name: '', photo: '' ,text:``},
    { name: '', photo: '' ,text:``},
    { name: '', photo: '' ,text:``},
    { name: '', photo: '' ,text:``},
    { name: '', photo: '' ,text:``},

]




export { ourPlayList, artists }